loadtest/loadtest.yml
config:
  target: "https://"
  http:
    timeout: 60
  processor: "generator.js"
  phases:
    - duration: 30
      arrivalRate: 1
    - duration: 20
      arrivalRate: 10
    - duration: 10
      arrivalRate: 5
    - duration: 120
      arrivalRate: 1
    - duration: 20
      arrivalRate: 10
    - duration: 10
      arrivalRate: 5
    - duration: 120
      arrivalRate: 1
    - duration: 30
      arrivalRate: 10
    - duration: 10
      arrivalRate: 5
    - duration: 120
      arrivalRate: 1
    - duration: 30
      arrivalRate: 1
    - duration: 20
      arrivalRate: 10
    - duration: 10
      arrivalRate: 5
    - duration: 120
      arrivalRate: 1
    - duration: 20
      arrivalRate: 10
    - duration: 10
      arrivalRate: 5
    - duration: 120
      arrivalRate: 1
    - duration: 30
      arrivalRate: 10
    - duration: 10
      arrivalRate: 5
    - duration: 120
      arrivalRate: 1

scenarios:
  - name: "User create order"
    flow:
      - function: "generateEmailAddress"
      - post:
          url: "{{ $processEnvironment.USER_API_ENDPOINT }}/user"
          headers:
            Content-Type: "application/json"
          json:
            email_address: "{{ Email }}"
            first_name: "Test"
            last_name: "User"
            password: "{{ Password }}"
      - post:
          url: "{{ $processEnvironment.USER_API_ENDPOINT }}/login"
          headers:
            Content-Type: "application/json"
          json:
            email_address: "{{ Email }}"
            password: "{{ Password }}"
          capture:
            json: "$.data.token"
            as: jwt
      - get:
          url: "{{ $processEnvironment.PRODUCT_API_ENDPOINT }}/product"
          capture:
            json: "$.data"
            as: products
      - function: setOrderProducts
      - post:
          url: "{{ $processEnvironment.ORDER_API_ENDPOINT }}/orders"
          headers:
            Content-Type: "application/json"
            Authorization: "Bearer {{jwt}}"
          json:
            products: "{{ OrderProducts }}"
          capture:
            json: "$.data.orderId"
            as: OrderId
  - name: "Admin complete order"
    flow:
      - post:
          url: "{{ $processEnvironment.USER_API_ENDPOINT }}/login"
          headers:
            Content-Type: "application/json"
          json:
            email_address: "admin@serverless-sample.com"
            password: "Admin!23"
          capture:
            json: "$.data.token"
            as: adminJwt
      - get:
          url: "{{ $processEnvironment.ORDER_API_ENDPOINT }}/orders/confirmed"
          headers:
            Authorization: "Bearer {{adminJwt}}"
          capture:
            json: "$"
            as: confirmedOrders
      - function: getLatestConfirmedOrder
      - post:
          url: "{{ $processEnvironment.ORDER_API_ENDPOINT }}/orders/{{ ConfirmedOrderId }}/complete"
          headers:
            Content-Type: "application/json"
            Authorization: "Bearer {{adminJwt}}"
          json:
            orderId: "{{ ConfirmedOrderId }}"
            userId: "{{ ConfirmedOrderUserId }}"

  - name: "Admin re-stock products"
    flow:
      - post:
          url: "{{ $processEnvironment.USER_API_ENDPOINT }}/login"
          headers:
            Content-Type: "application/json"
          json:
            email_address: "admin@serverless-sample.com"
            password: "Admin!23"
          capture:
            json: "$.data.token"
            as: adminJwt
      - get:
          url: "{{ $processEnvironment.PRODUCT_API_ENDPOINT }}/product"
          capture:
            json: "$.data"
            as: products
      - function: setOutOfStockProductId
      - get:
          url: "{{ $processEnvironment.INVENTORY_API_ENDPOINT }}/inventory/{{ ProductId }}"
          ifTrue: 'ProductId'
          headers:
            Authorization: "Bearer {{adminJwt}}"
          capture:
            json: "$.data.currentStockLevel"
            as: currentStockLevel
      - function: generateRestockAmount
      - post:
          url: "{{ $processEnvironment.INVENTORY_API_ENDPOINT }}/inventory"
          ifTrue: 'ProductId'
          headers:
            Content-Type: "application/json"
            Authorization: "Bearer {{adminJwt}}"
          json:
            productId: "{{ProductId}}"
            stockLevel: "{{NewStockLevel}}"